Repository_Hosting_Services_research.org
#+TITLE: Look into APIs for accessing Repository Hosting Services
#+LANGUAGE: en
#+OPTIONS: toc:nil h:4 html-postamble:nil html-preamble:t tex:t f:t
#+OPTIONS: prop:("VERSION")
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="css/style.css" rel="stylesheet" type="text/css" />
#+AUTHOR: Shane Mulligan
#+EMAIL: mailto:mullikine@gmail.com

#+HTML: <div class="outline-2" id="meta">
| *Author* | {{{author}}} ({{{email}}})    |
| *Date*   | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: </div>

* Questions/Answers
1. Is Google Code [Search] still accessible through an API? [[https://www.programmableweb.com/news/13-google-apis-are-no-more/2011/10/19][No, The API is gone.]]

* Look into software for accessing APIs
DEADLINE: <2018-03-23 Fri>
** GitHub API
*** apt
#+BEGIN_SRC bash
apt search github
#+END_SRC

Results
#+BEGIN_SRC text
libghc-github-dev/xenial 0.13.2-4build1 amd64
  Haskell Github API

libghc-github-doc/xenial,xenial 0.13.2-4build1 all
  Haskell Github API; documentation

libghc-github-prof/xenial 0.13.2-4build1 amd64
  Haskell Github API; profiling libraries
#+END_SRC
**** Common Lisp Github API
#+BEGIN_SRC text
cl-github-v3/xenial,xenial 20130312-1 all
  Common Lisp interface to the github V3 API
#+END_SRC

*** pip
#+BEGIN_SRC bash
pip search github
#+END_SRC

Results
#+BEGIN_SRC text
Github-API-3-Wrapper-for-Python (0.0.1)                  - Github API 3 Wrapper for Python
sqre-github3.py (1.0.0a4)                                - Python wrapper for the GitHub API(http://developer.github.com/v3)
github3.py (1.0.1)                                       - Python wrapper for the GitHub API(http://developer.github.com/v3)
sqre-codekit-github3.py (1.0.0a4)                        - Python wrapper for the GitHub API(http://developer.github.com/v3)
githon (0.7.0)                                           - A simple Data Scraping library for GitHub REST API v3
githubcap (0.0.0)                                        - Tool and library for interacting with GitHub API v3
gitpanion (1.0.0.2)                                      - A module to make using the github v3 REST api in python 3 easy.
githubpy (1.1.0)                                         - Github v3 API Python SDK
PyGithub-requests (1.26.0)                               - Use the full Github API v3
pygithub-redux (1.33.0)                                  - Use the full Github API v3
PyGithub (1.38)                                          - Use the full Github API v3
pygithub3 (0.5.1)                                        - Python wrapper for the github v3 api
pygithub33 (0.6.2)                                       - Python wrapper for the github v3 api
helga-github-meta (1.1.0)                                - Provide information for github related metadata
#+END_SRC

| package           | relevance |
|-------------------+-----------|
| helga-github-meta | High      |
| githon            | High      |

** GitLab API
*** apt
#+BEGIN_SRC bash
apt search gitlab
#+END_SRC

Results
**** Python Gitlab
#+BEGIN_SRC text
python-gitlab/xenial,xenial 7.5.0-1 all
  Python wrapper for the GitLab API (Python 2)

python3-gitlab/xenial,xenial 7.5.0-1 all
  Python wrapper for the GitLab API (Python 3)
#+END_SRC

*** pip
#+BEGIN_SRC bash
pip search gitlab
#+END_SRC

Results
#+BEGIN_SRC text
git-gitlab (0.6.0)                              - Git extension commandline for GitLab API v3
#+END_SRC

** SourceGraph API
github
#+BEGIN_SRC bash
googler -w github.com -- "sourcegraph api"
#+END_SRC

Results
#+BEGIN_SRC text
https://github.com/sourcegraph/go-sourcegraph
#+END_SRC

* TODO overview of APIs for respository hosting services and code search servers
DEADLINE: <2018-03-23 Fri>

