Repository_Hosting_Services_research.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-03-27 Tue 00:11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Look into APIs for accessing Repository Hosting Services</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Shane Mulligan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Look into APIs for accessing Repository Hosting Services</h1>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Author</b></td>
<td class="org-left">Shane Mulligan (<a href="mailto:mullikine@gmail.com">mailto:mullikine@gmail.com</a>)</td>
</tr>

<tr>
<td class="org-left"><b>Date</b></td>
<td class="org-left">2018-03-27 00:11:19</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org413bb5a" class="outline-2">
<h2 id="org413bb5a"><span class="section-number-2">1</span> Questions/Answers</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Is Google Code [Search] still accessible through an API? <a href="https://www.programmableweb.com/news/13-google-apis-are-no-more/2011/10/19">No, The API is gone.</a></li>
</ol>
</div>
</div>

<div id="outline-container-org153285a" class="outline-2">
<h2 id="org153285a"><span class="section-number-2">2</span> Look into software for accessing APIs</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgac0fcee" class="outline-3">
<h3 id="orgac0fcee"><span class="section-number-3">2.1</span> GitHub API</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org1dd1f66" class="outline-4">
<h4 id="org1dd1f66"><span class="section-number-4">2.1.1</span> apt</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-bash">apt search github
</pre>
</div>

<p>
Results
</p>
<div class="org-src-container">
<pre class="src src-text">libghc-github-dev/xenial 0.13.2-4build1 amd64
  Haskell Github API

libghc-github-doc/xenial,xenial 0.13.2-4build1 all
  Haskell Github API; documentation

libghc-github-prof/xenial 0.13.2-4build1 amd64
  Haskell Github API; profiling libraries
</pre>
</div>
</div>
<div id="outline-container-orgb2c80a7" class="outline-5">
<h5 id="orgb2c80a7"><span class="section-number-5">2.1.1.1</span> Common Lisp Github API</h5>
<div class="outline-text-5" id="text-2-1-1-1">
<div class="org-src-container">
<pre class="src src-text">cl-github-v3/xenial,xenial 20130312-1 all
  Common Lisp interface to the github V3 API
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2740629" class="outline-4">
<h4 id="org2740629"><span class="section-number-4">2.1.2</span> pip</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-bash">pip search github
</pre>
</div>

<p>
Results
</p>
<div class="org-src-container">
<pre class="src src-text">Github-API-3-Wrapper-for-Python (0.0.1)                  - Github API 3 Wrapper for Python
sqre-github3.py (1.0.0a4)                                - Python wrapper for the GitHub API(http://developer.github.com/v3)
github3.py (1.0.1)                                       - Python wrapper for the GitHub API(http://developer.github.com/v3)
sqre-codekit-github3.py (1.0.0a4)                        - Python wrapper for the GitHub API(http://developer.github.com/v3)
githon (0.7.0)                                           - A simple Data Scraping library for GitHub REST API v3
githubcap (0.0.0)                                        - Tool and library for interacting with GitHub API v3
gitpanion (1.0.0.2)                                      - A module to make using the github v3 REST api in python 3 easy.
githubpy (1.1.0)                                         - Github v3 API Python SDK
PyGithub-requests (1.26.0)                               - Use the full Github API v3
pygithub-redux (1.33.0)                                  - Use the full Github API v3
PyGithub (1.38)                                          - Use the full Github API v3
pygithub3 (0.5.1)                                        - Python wrapper for the github v3 api
pygithub33 (0.6.2)                                       - Python wrapper for the github v3 api
helga-github-meta (1.1.0)                                - Provide information for github related metadata
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">package</th>
<th scope="col" class="org-left">relevance</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">helga-github-meta</td>
<td class="org-left">High</td>
</tr>

<tr>
<td class="org-left">githon</td>
<td class="org-left">High</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgd8a23f1" class="outline-3">
<h3 id="orgd8a23f1"><span class="section-number-3">2.2</span> GitLab API</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgaf5bc69" class="outline-4">
<h4 id="orgaf5bc69"><span class="section-number-4">2.2.1</span> apt</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-bash">apt search gitlab
</pre>
</div>

<p>
Results
</p>
</div>
<div id="outline-container-org7c67f87" class="outline-5">
<h5 id="org7c67f87"><span class="section-number-5">2.2.1.1</span> Python Gitlab</h5>
<div class="outline-text-5" id="text-2-2-1-1">
<div class="org-src-container">
<pre class="src src-text">python-gitlab/xenial,xenial 7.5.0-1 all
  Python wrapper for the GitLab API (Python 2)

python3-gitlab/xenial,xenial 7.5.0-1 all
  Python wrapper for the GitLab API (Python 3)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org11543be" class="outline-4">
<h4 id="org11543be"><span class="section-number-4">2.2.2</span> pip</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-bash">pip search gitlab
</pre>
</div>

<p>
Results
</p>
<div class="org-src-container">
<pre class="src src-text">git-gitlab (0.6.0)                              - Git extension commandline for GitLab API v3
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbda8291" class="outline-3">
<h3 id="orgbda8291"><span class="section-number-3">2.3</span> SourceGraph API</h3>
<div class="outline-text-3" id="text-2-3">
<p>
github
</p>
<div class="org-src-container">
<pre class="src src-bash">googler -w github.com -- <span style="color: #ffa07a;">"sourcegraph api"</span>
</pre>
</div>

<p>
Results
</p>
<div class="org-src-container">
<pre class="src src-text">https://github.com/sourcegraph/go-sourcegraph
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcdbc854" class="outline-2">
<h2 id="orgcdbc854"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> overview of APIs for respository hosting services and code search servers</h2>
<div class="outline-text-2" id="text-3">
</div>
