Repository_Hosting_Services_research.md
<div class="outline-2" id="meta">

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">**Author**</td>
<td class="org-left">Shane Mulligan (<mailto:mullikine@gmail.com>)</td>
</tr>


<tr>
<td class="org-left">**Date**</td>
<td class="org-left">2018-03-26 16:00:01</td>
</tr>
</tbody>
</table>

</div>


# Questions/Answers

1.  Is Google Code [Search] still accessible through an API? [No, The API is gone.](https://www.programmableweb.com/news/13-google-apis-are-no-more/2011/10/19)


# Look into software for accessing APIs


## GitHub API


### apt

    apt search github

Results

    libghc-github-dev/xenial 0.13.2-4build1 amd64
      Haskell Github API
    
    libghc-github-doc/xenial,xenial 0.13.2-4build1 all
      Haskell Github API; documentation
    
    libghc-github-prof/xenial 0.13.2-4build1 amd64
      Haskell Github API; profiling libraries


#### Common Lisp Github API

    cl-github-v3/xenial,xenial 20130312-1 all
      Common Lisp interface to the github V3 API


### pip

    pip search github

Results

    Github-API-3-Wrapper-for-Python (0.0.1)                  - Github API 3 Wrapper for Python
    sqre-github3.py (1.0.0a4)                                - Python wrapper for the GitHub API(http://developer.github.com/v3)
    github3.py (1.0.1)                                       - Python wrapper for the GitHub API(http://developer.github.com/v3)
    sqre-codekit-github3.py (1.0.0a4)                        - Python wrapper for the GitHub API(http://developer.github.com/v3)
    githon (0.7.0)                                           - A simple Data Scraping library for GitHub REST API v3
    githubcap (0.0.0)                                        - Tool and library for interacting with GitHub API v3
    gitpanion (1.0.0.2)                                      - A module to make using the github v3 REST api in python 3 easy.
    githubpy (1.1.0)                                         - Github v3 API Python SDK
    PyGithub-requests (1.26.0)                               - Use the full Github API v3
    pygithub-redux (1.33.0)                                  - Use the full Github API v3
    PyGithub (1.38)                                          - Use the full Github API v3
    pygithub3 (0.5.1)                                        - Python wrapper for the github v3 api
    pygithub33 (0.6.2)                                       - Python wrapper for the github v3 api
    helga-github-meta (1.1.0)                                - Provide information for github related metadata

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">package</th>
<th scope="col" class="org-left">relevance</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">helga-github-meta</td>
<td class="org-left">High</td>
</tr>


<tr>
<td class="org-left">githon</td>
<td class="org-left">High</td>
</tr>
</tbody>
</table>


## GitLab API


### apt

    apt search gitlab

Results


#### Python Gitlab

    python-gitlab/xenial,xenial 7.5.0-1 all
      Python wrapper for the GitLab API (Python 2)
    
    python3-gitlab/xenial,xenial 7.5.0-1 all
      Python wrapper for the GitLab API (Python 3)


### pip

    pip search gitlab

Results

    git-gitlab (0.6.0)                              - Git extension commandline for GitLab API v3


## SourceGraph API

github

    googler -w github.com -- "sourcegraph api"

Results

    https://github.com/sourcegraph/go-sourcegraph


# TODO overview of APIs for respository hosting services and code search servers
