Repository_Hosting_Services_research.org
** Repository Hosting Services
  #+NAME: TBL-point_of_difference
| Service     | status                                           | point of difference                               | Domain                        | API Documentation | Version | MetaData | wiki                                             |
|-------------+--------------------------------------------------+---------------------------------------------------+-------------------------------+-------------------+---------+----------+--------------------------------------------------|
| GitHub      | [fn:gh_verypop] > 24,377,273 users, > $2 billion | Largest, Best metadata?                           |                               | [[https://developer.github.com/v3/][V3 Doc]]            | v3      |          | https://en.wikipedia.org/wiki/GitHub             |
| GitLab      | Used by > 100,000 organizations                  | Continuous Integration is free                    |                               | [[https://docs.gitlab.com/ee/api/README.html][Readme]]            | v4      |          | https://en.wikipedia.org/wiki/GitLab             |
| BitBucket   | Online                                           | mostly used for code and code review              |                               | [[https://developer.atlassian.com/bitbucket/api/2/reference/resource/repositories][V2 Repositories]]   | 2.0     |          | https://en.wikipedia.org/wiki/Bitbucket          |
| Merobase    | Online                                           | [fn:mb_interface] interface-driven searches       |                               |                   |         |          | https://en.wikipedia.org/wiki/Merobase           |
| Krugle      | active                                           | locate open source code, and quickly share it     | Apache, JavaDocs, SourceForge |                   |         |          | https://en.wikipedia.org/wiki/Krugle             |
| Open Hub    | $565 million                                     | licenses (including license conflict information) |                               | [[https://github.com/blackducksoftware/ohloh_api][README]]            |         |          | https://en.wikipedia.org/wiki/Open_Hub                                                 |
| Google Code | archived (still accessible but not through api)  | regex [fn:g_regex]                                |                               | [[https://code.google.com/archive/][Notice]]            |         |          | https://en.wikipedia.org/wiki/Google_Code_Search |

** Code Search Servers
  #+NAME: TBL-code_search_servers
| Service     | status | point of difference                                           | API Documentation       | Version | MetaData | wiki |
|-------------+--------+---------------------------------------------------------------+-------------------------+---------+----------+------|
| SourceGraph | Online | find, review, understand, and debug code. regex [fn:sg_regex] | [[https://about.sourcegraph.com/docs/server/api/][Server API]], [[https://sourcegraph.com/api/console][Console API]] |         |          |      |
| OpenGrok    | Online |                                                               |                         |         |          |      |

[fn:gh_verypop] 26 million people and 1.5 million organizations created 67 million repositories on GitHub in 2017.
[fn:sg_regex] regular expressions and exact queries to perform full-text searches.
[fn:g_regex] regular expressions in queries, which at the time was not offered by any other search engine for code. grep, but over the world's public code.
[fn:mb_interface] interface-driven searches – that is, searches based on the abstract interface that a component offers rather than on the text in its source code.

