Repository_Hosting_Services_research.html

<div id="outline-container-org49cb9ca" class="outline-3">
<h3 id="org49cb9ca"><span class="section-number-3">3.1</span> Repository Hosting Services</h3>
<div class="outline-text-3" id="text-3-1">
<table id="org203ed55">


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Service</th>
<th scope="col" class="org-left">status</th>
<th scope="col" class="org-left">point of difference</th>
<th scope="col" class="org-left">Domain</th>
<th scope="col" class="org-left">API Documentation</th>
<th scope="col" class="org-right">Version</th>
<th scope="col" class="org-left">MetaData</th>
<th scope="col" class="org-left">wiki</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GitHub</td>
<td class="org-left"><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> &gt; 24,377,273 users, &gt; $2 billion</td>
<td class="org-left">Largest, Best metadata?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://developer.github.com/v3/">V3 Doc</a></td>
<td class="org-right">v3</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/GitHub">https://en.wikipedia.org/wiki/GitHub</a></td>
</tr>

<tr>
<td class="org-left">GitLab</td>
<td class="org-left">Used by &gt; 100,000 organizations</td>
<td class="org-left">Continuous Integration is free</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://docs.gitlab.com/ee/api/README.html">Readme</a></td>
<td class="org-right">v4</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/GitLab">https://en.wikipedia.org/wiki/GitLab</a></td>
</tr>

<tr>
<td class="org-left">BitBucket</td>
<td class="org-left">Online</td>
<td class="org-left">mostly used for code and code review</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://developer.atlassian.com/bitbucket/api/2/reference/resource/repositories">V2 Repositories</a></td>
<td class="org-right">2.0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Bitbucket">https://en.wikipedia.org/wiki/Bitbucket</a></td>
</tr>

<tr>
<td class="org-left">Merobase</td>
<td class="org-left">Online</td>
<td class="org-left"><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> interface-driven searches</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Merobase">https://en.wikipedia.org/wiki/Merobase</a></td>
</tr>

<tr>
<td class="org-left">Krugle</td>
<td class="org-left">active</td>
<td class="org-left">locate open source code, and quickly share it</td>
<td class="org-left">Apache, JavaDocs, SourceForge</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Krugle">https://en.wikipedia.org/wiki/Krugle</a></td>
</tr>

<tr>
<td class="org-left">Open Hub</td>
<td class="org-left">$565 million</td>
<td class="org-left">licenses (including license conflict information)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://github.com/blackducksoftware/ohloh_api">README</a></td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Open_Hub">https://en.wikipedia.org/wiki/Open_Hub</a></td>
</tr>

<tr>
<td class="org-left">Google Code</td>
<td class="org-left">archived (still accessible but not through api)</td>
<td class="org-left">regex <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://code.google.com/archive/">Notice</a></td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Google_Code_Search">https://en.wikipedia.org/wiki/Google_Code_Search</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2668a64" class="outline-3">
<h3 id="org2668a64"><span class="section-number-3">3.2</span> Code Search Servers</h3>
<div class="outline-text-3" id="text-3-2">
<table id="org7147861">


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Service</th>
<th scope="col" class="org-left">status</th>
<th scope="col" class="org-left">point of difference</th>
<th scope="col" class="org-left">API Documentation</th>
<th scope="col" class="org-left">Version</th>
<th scope="col" class="org-left">MetaData</th>
<th scope="col" class="org-left">wiki</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SourceGraph</td>
<td class="org-left">Online</td>
<td class="org-left">find, review, understand, and debug code. regex <sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></td>
<td class="org-left"><a href="https://about.sourcegraph.com/docs/server/api/">Server API</a>, <a href="https://sourcegraph.com/api/console">Console API</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">OpenGrok</td>
<td class="org-left">Online</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
