Repository_Hosting_Services_research.org
* Feature summary and comparison
|-----------------------------------+--------------------+--------------------------+---------------------------------|
| Feature                           |           OpenGrok | GitHub/GitHub Enterprise |                     SourceGraph |
|-----------------------------------+--------------------+--------------------------+---------------------------------|
| Multi-repository full-text search |                  1 |                        1 |                               1 |
| At any revision                   |                  0 |                        0 |                               1 |
| Indexing delay                    |              Hours |      Varies, not instant |                 No index needed |
| Search commit diffs               |                  0 |                        0 |                               1 |
| Search commit messages            |                  0 |                        1 |                               1 |
| Query latency                     |                  1 |                        1 |                               1 |
| Include/exclude paths and globs   |                  1 |                0 Limited |                               1 |
| Regular expressions               | 0 (wildcards only) |                        0 |                               1 |
| Saved searches                    |                  0 |                        0 |                               1 |
| Doc/type hover tooltips           |                  0 |                        0 |                               1 |
| Code review integration           |                  0 |                        0 |                               1 |
| Editor integration                |                  1 |                        0 |                               1 |
| Web app                           |                  1 |                        1 |                               1 |
| Integrated blame                  |                  1 |   0 Multiple clicks away |                               1 |
| Nice URLs                         |                  1 |                        1 | 1 (+ selection range & symbols) |
|-----------------------------------+--------------------+--------------------------+---------------------------------|

* SourceGraph API research

** Do these features only work for a personal SourceGraph server?
| Feature                            | Paid | url                                                   | How                                                                                     |
|------------------------------------+------+-------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Code Intelligence [fn:sg_features] | ✓    | https://about.sourcegraph.com/docs/code-intelligence/ | Provided by language servers that run securely in your self-hosted SourceGraph instance |

[fn:sg_features] + Hover tooltips with documentation and type signatures, + Go to definition, + Find references                                      

https://about.sourcegraph.com/docs/server/api/

