Repository_Hosting_Services_research.html

<div id="outline-container-orgf5d52d1" class="outline-2">
<h2 id="orgf5d52d1"><span class="section-number-2">4</span> Feature summary and comparison</h2>
<div class="outline-text-2" id="text-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-right">OpenGrok</th>
<th scope="col" class="org-right">GitHub/GitHub Enterprise</th>
<th scope="col" class="org-right">SourceGraph</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Multi-repository full-text search</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">At any revision</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Indexing delay</td>
<td class="org-right">Hours</td>
<td class="org-right">Varies, not instant</td>
<td class="org-right">No index needed</td>
</tr>

<tr>
<td class="org-left">Search commit diffs</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Search commit messages</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Query latency</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Include/exclude paths and globs</td>
<td class="org-right">1</td>
<td class="org-right">0 Limited</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Regular expressions</td>
<td class="org-right">0 (wildcards only)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Saved searches</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Doc/type hover tooltips</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Code review integration</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Editor integration</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Web app</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Integrated blame</td>
<td class="org-right">1</td>
<td class="org-right">0 Multiple clicks away</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Nice URLs</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1 (+ selection range &amp; symbols)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgdcd0247" class="outline-2">
<h2 id="orgdcd0247"><span class="section-number-2">5</span> SourceGraph API research</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgffa7260" class="outline-3">
<h3 id="orgffa7260"><span class="section-number-3">5.1</span> Do these features only work for a personal SourceGraph server?</h3>
<div class="outline-text-3" id="text-5-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Paid</th>
<th scope="col" class="org-left">url</th>
<th scope="col" class="org-left">How</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Code Intelligence <sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup></td>
<td class="org-left">✓</td>
<td class="org-left"><a href="https://about.sourcegraph.com/docs/code-intelligence/">https://about.sourcegraph.com/docs/code-intelligence/</a></td>
<td class="org-left">Provided by language servers that run securely in your self-hosted SourceGraph instance</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
