Repository_Hosting_Services_research.org
* Bitbucket API research

Endpoints
|                         | doc | use case |
| all public repositories | ?   |          |

Howto
[[https://confluence.atlassian.com/bitbucket/use-the-bitbucket-cloud-rest-apis-222724129.html][REST APIs - Atlassian Documentation]]

Standard HTTP behavior
| Call   | Description                   |
|--------+-------------------------------|
| GET    | Retrieves information.        |
| PUT    | Updates existing information. |
| POST   | Creates new information.      |
| DELETE | Removes existing information. |


* GitLab API research
DEADLINE: <2018-03-26 Mon>

** Protocol
| protocol                 |
|--------------------------|
| HTTP. Moving to GraphQL. |

** Project-specific repository search (where to find all-public api?)
| doc url                                          |
|--------------------------------------------------|
| https://docs.gitlab.com/ee/api/repositories.html |

** GitLab Automation
| doc url                                    |
|--------------------------------------------|
| https://docs.gitlab.com/ee/api/README.html |

** Code search queries
| doc url                                    |
|--------------------------------------------|
| https://docs.gitlab.com/ee/api/search.html |

** Example commands
| Information Need | Command                                                                                  |
|------------------+------------------------------------------------------------------------------------------|
| merge requests   | rhs gitlab get https://gitlab.example.com/api/v4/search?scope=merge_requests&search=file |

* GitHub API research

** Legacy Search
https://developer.github.com/v3/search/legacy/

This is a listing of the Legacy Search API features from API v2 that have been ported to API v3. There should be no changes, other than the new URL and JSON output format.

** Current API
[[https://developer.github.com/v3/][GitHub REST API v3.]]

** Protocol
| protocol                 |
|--------------------------|
| HTTP. Moving to GraphQL. |


** Example commands
| Information Need | documentation                           | use case                                                                              | command                                                                                     |
|------------------+-----------------------------------------+---------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------|
| code             | https://developer.github.com/v3/search/ |                                                                                       |                                                                                             |
| Highlighting     |                                         | This provides a dump of every public repository, in the order that they were created. | https://api.github.com/search/repositories?q=tetris+language:assembly&sort=stars&order=desc |

** Metadata

You can find:
1. repositories
2. commits
3. code
4. files (in repository)
5. issues
6. users
7. topics
8. labels
9. Text match metadata

*** TODO Find how to get more metadata
- number of repositories?

