Repository_Hosting_Services_research.html

<div id="outline-container-org379818a" class="outline-2">
<h2 id="org379818a"><span class="section-number-2">6</span> Bitbucket API research</h2>
<div class="outline-text-2" id="text-6">
<p>
Endpoints
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">doc</td>
<td class="org-left">use case</td>
</tr>

<tr>
<td class="org-left">all public repositories</td>
<td class="org-left">?</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Howto
<a href="https://confluence.atlassian.com/bitbucket/use-the-bitbucket-cloud-rest-apis-222724129.html">REST APIs - Atlassian Documentation</a>
</p>

<p>
Standard HTTP behavior
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Call</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">Retrieves information.</td>
</tr>

<tr>
<td class="org-left">PUT</td>
<td class="org-left">Updates existing information.</td>
</tr>

<tr>
<td class="org-left">POST</td>
<td class="org-left">Creates new information.</td>
</tr>

<tr>
<td class="org-left">DELETE</td>
<td class="org-left">Removes existing information.</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org8669e44" class="outline-2">
<h2 id="org8669e44"><span class="section-number-2">7</span> GitLab API research</h2>
<div class="outline-text-2" id="text-7">
</div>

<div id="outline-container-org3f252c6" class="outline-3">
<h3 id="org3f252c6"><span class="section-number-3">7.1</span> Protocol</h3>
<div class="outline-text-3" id="text-7-1">
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">protocol</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">HTTP. Moving to GraphQL.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org300ebeb" class="outline-3">
<h3 id="org300ebeb"><span class="section-number-3">7.2</span> Project-specific repository search (where to find all-public api?)</h3>
<div class="outline-text-3" id="text-7-2">
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">doc url</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://docs.gitlab.com/ee/api/repositories.html">https://docs.gitlab.com/ee/api/repositories.html</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1a6bf7b" class="outline-3">
<h3 id="org1a6bf7b"><span class="section-number-3">7.3</span> GitLab Automation</h3>
<div class="outline-text-3" id="text-7-3">
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">doc url</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://docs.gitlab.com/ee/api/README.html">https://docs.gitlab.com/ee/api/README.html</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org292b47f" class="outline-3">
<h3 id="org292b47f"><span class="section-number-3">7.4</span> Code search queries</h3>
<div class="outline-text-3" id="text-7-4">
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">doc url</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://docs.gitlab.com/ee/api/search.html">https://docs.gitlab.com/ee/api/search.html</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9513996" class="outline-3">
<h3 id="org9513996"><span class="section-number-3">7.5</span> Example commands</h3>
<div class="outline-text-3" id="text-7-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Information Need</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">merge requests</td>
<td class="org-left">rhs gitlab get <a href="https://gitlab.example.com/api/v4/search?scope=merge_requests&amp;search=file">https://gitlab.example.com/api/v4/search?scope=merge_requests&amp;search=file</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org0b33cc1" class="outline-2">
<h2 id="org0b33cc1"><span class="section-number-2">8</span> GitHub API research</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org22be369" class="outline-3">
<h3 id="org22be369"><span class="section-number-3">8.1</span> Legacy Search</h3>
<div class="outline-text-3" id="text-8-1">
<p>
<a href="https://developer.github.com/v3/search/legacy/">https://developer.github.com/v3/search/legacy/</a>
</p>

<p>
This is a listing of the Legacy Search API features from API v2 that have been ported to API v3. There should be no changes, other than the new URL and JSON output format.
</p>
</div>
</div>

<div id="outline-container-org25db3c3" class="outline-3">
<h3 id="org25db3c3"><span class="section-number-3">8.2</span> Current API</h3>
<div class="outline-text-3" id="text-8-2">
<p>
<a href="https://developer.github.com/v3/">GitHub REST API v3.</a>
</p>
</div>
</div>

<div id="outline-container-orgf5119a0" class="outline-3">
<h3 id="orgf5119a0"><span class="section-number-3">8.3</span> Protocol</h3>
<div class="outline-text-3" id="text-8-3">
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">protocol</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">HTTP. Moving to GraphQL.</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org2ad9f8f" class="outline-3">
<h3 id="org2ad9f8f"><span class="section-number-3">8.4</span> Example commands</h3>
<div class="outline-text-3" id="text-8-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Information Need</th>
<th scope="col" class="org-left">documentation</th>
<th scope="col" class="org-left">use case</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">code</td>
<td class="org-left"><a href="https://developer.github.com/v3/search/">https://developer.github.com/v3/search/</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Highlighting</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">This provides a dump of every public repository, in the order that they were created.</td>
<td class="org-left"><a href="https://api.github.com/search/repositories?q=tetris+language:assembly&amp;sort=stars&amp;order=desc">https://api.github.com/search/repositories?q=tetris+language:assembly&amp;sort=stars&amp;order=desc</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf39b265" class="outline-3">
<h3 id="orgf39b265"><span class="section-number-3">8.5</span> Metadata</h3>
<div class="outline-text-3" id="text-8-5">
<p>
You can find:
</p>
<ol class="org-ol">
<li>repositories</li>
<li>commits</li>
<li>code</li>
<li>files (in repository)</li>
<li>issues</li>
<li>users</li>
<li>topics</li>
<li>labels</li>
<li>Text match metadata</li>
</ol>
</div>

<div id="outline-container-org22fcc67" class="outline-4">
<h4 id="org22fcc67"><span class="section-number-4">8.5.1</span> <span class="todo TODO">TODO</span> Find how to get more metadata</h4>
<div class="outline-text-4" id="text-8-5-1">
<ul class="org-ul">
<li>number of repositories?</li>
</ul>
</div>
</div>
</div>
