Repository_Hosting_Services_research.md


# Bitbucket API research

Endpoints

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">doc</td>
<td class="org-left">use case</td>
</tr>


<tr>
<td class="org-left">all public repositories</td>
<td class="org-left">?</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

Howto
[REST APIs - Atlassian Documentation](https://confluence.atlassian.com/bitbucket/use-the-bitbucket-cloud-rest-apis-222724129.html)

Standard HTTP behavior

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Call</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">Retrieves information.</td>
</tr>


<tr>
<td class="org-left">PUT</td>
<td class="org-left">Updates existing information.</td>
</tr>


<tr>
<td class="org-left">POST</td>
<td class="org-left">Creates new information.</td>
</tr>


<tr>
<td class="org-left">DELETE</td>
<td class="org-left">Removes existing information.</td>
</tr>
</tbody>
</table>


# GitLab API research


## Protocol

<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">protocol</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">HTTP. Moving to GraphQL.</td>
</tr>
</tbody>
</table>


## Project-specific repository search (where to find all-public api?)

<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">doc url</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><https://docs.gitlab.com/ee/api/repositories.html></td>
</tr>
</tbody>
</table>


## GitLab Automation

<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">doc url</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><https://docs.gitlab.com/ee/api/README.html></td>
</tr>
</tbody>
</table>


## Code search queries

<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">doc url</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><https://docs.gitlab.com/ee/api/search.html></td>
</tr>
</tbody>
</table>


## Example commands

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Information Need</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">merge requests</td>
<td class="org-left">rhs gitlab get <https://gitlab.example.com/api/v4/search?scope=merge_requests&search=file></td>
</tr>
</tbody>
</table>


# GitHub API research


## Legacy Search

<https://developer.github.com/v3/search/legacy/>

This is a listing of the Legacy Search API features from API v2 that have been ported to API v3. There should be no changes, other than the new URL and JSON output format.


## Current API

[GitHub REST API v3.](https://developer.github.com/v3/)


## Protocol

<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">protocol</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">HTTP. Moving to GraphQL.</td>
</tr>
</tbody>
</table>


## Example commands

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Information Need</th>
<th scope="col" class="org-left">documentation</th>
<th scope="col" class="org-left">use case</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">code</td>
<td class="org-left"><https://developer.github.com/v3/search/></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Highlighting</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">This provides a dump of every public repository, in the order that they were created.</td>
<td class="org-left"><https://api.github.com/search/repositories?q=tetris+language:assembly&sort=stars&order=desc></td>
</tr>
</tbody>
</table>


## Metadata

You can find:

1.  repositories
2.  commits
3.  code
4.  files (in repository)
5.  issues
6.  users
7.  topics
8.  labels
9.  Text match metadata


### TODO Find how to get more metadata

-   number of repositories?
