Repository_Hosting_Services_research.html

<div id="outline-container-org24442d7" class="outline-3">
<h3 id="org24442d7"><span class="section-number-3">8.6</span> Ranking</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Sort by best match, as indicated by the score field for each item returned.
</p>

<p>
Score is a computed value representing the relevance of an item relative to the other items in the result set.
</p>

<p>
Multiple factors are combined to boost the most relevant item to the top of the result list.
</p>
</div>
</div>

<div id="outline-container-org3c7a55a" class="outline-3">
<h3 id="org3c7a55a"><span class="section-number-3">8.7</span> Highlighting repository search results</h3>
<div class="outline-text-3" id="text-8-7">
<p>
You can highlight matching search terms when displaying search results.
</p>

<p>
The API offers additional metadata to support this use case.
</p>

<p>
To get this metadata in your search results, specify the text-match media type in your Accept header.
</p>

<p>
Example
</p>
<div class="org-src-container">
<pre class="src src-bash">curl -H <span style="color: #ffa07a;">'Accept: application/vnd.github.v3.text-match+json'</span> <span style="color: #ffa07a;">\</span>
  <span style="color: #ffa07a;">'https://api.github.com/search/repositories?q=tetris+language:assembly&amp;sort=stars&amp;order=desc'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ffae0f" class="outline-3">
<h3 id="org1ffae0f"><span class="section-number-3">8.8</span> Use cases</h3>
<div class="outline-text-3" id="text-8-8">
</div>
<div id="outline-container-org70957a2" class="outline-4">
<h4 id="org70957a2"><span class="section-number-4">8.8.1</span> Suppose you want to find commits related to CSS in the octocat/Spoon-Knife repository. Your query would look something like this:</h4>
<div class="outline-text-4" id="text-8-8-1">
<div class="org-src-container">
<pre class="src src-text">https://api.github.com/search/repositories?q=tetris+language:assembly&amp;sort=stars&amp;order=desc
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org338fc3d" class="outline-3">
<h3 id="org338fc3d"><span class="section-number-3">8.9</span> All endpoints</h3>
<div class="outline-text-3" id="text-8-9">
<p>
<a href="https://developer.github.com/v3/apps/available-endpoints/">https://developer.github.com/v3/apps/available-endpoints/</a>
</p>

<dl class="org-dl">
<dt><a href="https://developer.github.com/v3/orgs/#list-all-organizations">list-all-organizations</a></dt><dd>Lists all organizations, in the order that they were created on GitHub.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgbfea019" class="outline-3">
<h3 id="orgbfea019"><span class="section-number-3">8.10</span> general api</h3>
<div class="outline-text-3" id="text-8-10">
<p>
If you are using an alternative client (wrapper), note that you are required to send a valid User Agent header in
your request.
</p>

<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">examples</td>
</tr>
</tbody>
</table>
<p>
<a href="https://gist.github.com/caspyin/2288960">https://gist.github.com/caspyin/2288960</a>
<a href="https://developer.github.com/v3/guides/getting-started/">https://developer.github.com/v3/guides/getting-started/</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org4761be7" class="outline-2">
<h2 id="org4761be7"><span class="section-number-2">9</span> Look into software for generating ASTs from source code</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org03bb9c7" class="outline-3">
<h3 id="org03bb9c7"><span class="section-number-3">9.1</span> python</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Generate Python files AST
</p>
</div>
<div id="outline-container-org9f75dce" class="outline-4">
<h4 id="org9f75dce"><span class="section-number-4">9.1.1</span> pip search results</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
<a href="https://www.srl.inf.ethz.ch/py150.php">Software Reliability Lab | ETH | Py150</a>
</p>
<div class="org-src-container">
<pre class="src src-text">bigcode-astgen
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf728416" class="outline-4">
<h4 id="orgf728416"><span class="section-number-4">9.1.2</span> Links</h4>
<div class="outline-text-4" id="text-9-1-2">
<p>
<a href="http://pyparsing.wikispaces.com/home">pyparsing is an alternative approach to creating and executing simple grammars, vs. the traditional lex/yacc approach, or the use of regular expressions</a>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org1e75a52" class="outline-2">
<h2 id="org1e75a52"><span class="section-number-2">10</span> Examples</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org7743614" class="outline-3">
<h3 id="org7743614"><span class="section-number-3">10.1</span> 5 entertaining things you can find with the GitHub Search API</h3>
<div class="outline-text-3" id="text-10-1">
<p>
<a href="https://gist.github.com/jasonrudolph/6065289">https://gist.github.com/jasonrudolph/6065289</a>
</p>

<ol class="org-ol">
<li><a href="https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/00-about-search-api-examples.md">00-about-search-api-examples.md 	# 5 entertaining things you can find with the GitHub Search API</a></li>
<li><a href="https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/01-trending-repos.md">01-trending-repos.md 	### Find the hottest repositories created in the last week</a></li>
<li><a href="https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/03-issue-trends.md">03-issue-trends.md 	### How many issues do Ruby developers create each day?</a></li>
<li><a href="https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/05-resig.md">05-resig.md 	### What does John Resig work on other than JavaScript?</a></li>
<li><a href="https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/06-trolls.md">06-trolls.md 	### Find the most commented issues in the past month</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgc42f70f" class="outline-2">
<h2 id="orgc42f70f"><span class="section-number-2">11</span> Searches</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li><a href="https://github.com/search?q=gitlab+api&amp;ref=opensearch">Find gitlab api projects on github</a></li>
<li><a href="https://github.com/search?q=github+api&amp;ref=opensearch">Find github api projects on github</a></li>
<li><a href="https://github.com/search?q=bitbucket+api&amp;ref=opensearch">Find bitbucket api projects on github</a></li>
</ul>
</div>
</div>



<div id="outline-container-org4e4a1bd" class="outline-2">
<h2 id="org4e4a1bd"><span class="section-number-2">12</span> <span class="todo TODO">TODO</span> Look into open source search engines</h2>
<div class="outline-text-2" id="text-12">
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Project</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ElasticSearch</td>
</tr>

<tr>
<td class="org-left">CodeSearch</td>
</tr>

<tr>
<td class="org-left">SphinxSearch</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org88a4465" class="outline-2">
<h2 id="org88a4465"><span class="section-number-2">13</span> Scripts</h2>
<div class="outline-text-2" id="text-13">
<p>
<a href="file:///home/shane/scripts/rhs">rhs &#x2013; repository hosting services script</a>
</p>
</div>
</div>
