Repository_Hosting_Services_research.md


## Ranking

Sort by best match, as indicated by the score field for each item returned.

Score is a computed value representing the relevance of an item relative to the other items in the result set.

Multiple factors are combined to boost the most relevant item to the top of the result list.


## Highlighting repository search results

You can highlight matching search terms when displaying search results.

The API offers additional metadata to support this use case.

To get this metadata in your search results, specify the text-match media type in your Accept header.

Example

    curl -H 'Accept: application/vnd.github.v3.text-match+json' \
      'https://api.github.com/search/repositories?q=tetris+language:assembly&sort=stars&order=desc'


## Use cases


### Suppose you want to find commits related to CSS in the octocat/Spoon-Knife repository. Your query would look something like this:

    https://api.github.com/search/repositories?q=tetris+language:assembly&sort=stars&order=desc


## All endpoints

<https://developer.github.com/v3/apps/available-endpoints/>

-   **[list-all-organizations](https://developer.github.com/v3/orgs/#list-all-organizations):** Lists all organizations, in the order that they were created on GitHub.


## general api

If you are using an alternative client (wrapper), note that you are required to send a valid User Agent header in
your request.

<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">examples</td>
</tr>
</tbody>
</table>

<https://gist.github.com/caspyin/2288960>
<https://developer.github.com/v3/guides/getting-started/>


# Look into software for generating ASTs from source code


## python

Generate Python files AST


### pip search results

[Software Reliability Lab | ETH | Py150](https://www.srl.inf.ethz.ch/py150.php)

    bigcode-astgen


### Links

[pyparsing is an alternative approach to creating and executing simple grammars, vs. the traditional lex/yacc approach, or the use of regular expressions](http://pyparsing.wikispaces.com/home)


# Examples


## 5 entertaining things you can find with the GitHub Search API

<https://gist.github.com/jasonrudolph/6065289>

1.  [00-about-search-api-examples.md 	# 5 entertaining things you can find with the GitHub Search API](https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/00-about-search-api-examples.md)
2.  [01-trending-repos.md 	### Find the hottest repositories created in the last week](https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/01-trending-repos.md)
3.  [03-issue-trends.md 	### How many issues do Ruby developers create each day?](https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/03-issue-trends.md)
4.  [05-resig.md 	### What does John Resig work on other than JavaScript?](https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/05-resig.md)
5.  [06-trolls.md 	### Find the most commented issues in the past month](https://gist.githubusercontent.com/jasonrudolph/6065289/raw/e666e9f42a2b53178c85742f87b192b167ba3620/06-trolls.md)


# Searches

-   [Find gitlab api projects on github](https://github.com/search?q=gitlab+api&ref=opensearch)
-   [Find github api projects on github](https://github.com/search?q=github+api&ref=opensearch)
-   [Find bitbucket api projects on github](https://github.com/search?q=bitbucket+api&ref=opensearch)


# TODO Look into open source search engines

<table>


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Project</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">ElasticSearch</td>
</tr>


<tr>
<td class="org-left">CodeSearch</td>
</tr>


<tr>
<td class="org-left">SphinxSearch</td>
</tr>
</tbody>
</table>
